
#include "functions.h"


/******************登录界面**********************/
void page_design1()
{
	printf("\n\n\n");
	printf("\t\t\t欢迎来到数字信号实验室！\n");
	printf("\t\t\t*----------------------*\n");
	printf("\t\t\t*---1-登录-------------*\n");
	printf("\t\t\t*---2-注册-------------*\n");
	printf("\t\t\t*---3-找回密码---------*\n");
	printf("\t\t\t*----------------------*\n");
	printf("\t\t\t************************\n");
	printf("\t\t\t请输入需要操作的选项：");
}


void page_design2(){
	
	printf("\n\n");
	printf("\t\t\t************************\n");
	printf("\t\t\t*----------------------*\n");
	printf("\t\t\t*---1-修改个人信息-----*\n");
	printf("\t\t\t*---2-查询图书资源-----*\n");
	printf("\t\t\t*---3-借还资源---------*\n");
	printf("\t\t\t*---4-修改密码---------*\n");
}


void page_design3()
{
	printf("\t\t\t*---5-添加图书---------*\n");
	printf("\t\t\t*---6-耗材信息---------*\n");
	printf("\t\t\t*---7-添加管理员-------*\n");
}


void page_design4()
{
printf("\t\t\t************************\n");
printf("\t\t\t*----------------------*\n");
printf("\t\t\t*---1-借---------------*\n");
printf("\t\t\t*---2-还---------------*\n");
printf("\t\t\t*----------------------*\n");
printf("\t\t\t************************\n");
}


void page_design5()
{
printf("\t\t\t************************\n");
printf("\t\t\t*----------------------*\n");
printf("\t\t\t*---1-查看耗材---------*\n");
printf("\t\t\t*---2-添加耗材---------*\n");
printf("\t\t\t*----------------------*\n");
printf("\t\t\t************************\n");
}


void page_design6()
{
printf("\t\t\t************************\n");
printf("\t\t\t*----------------------*\n");
printf("\t\t\t*---1-返回首页---------*\n");
printf("\t\t\t*---2-退出-------------*\n");
printf("\t\t\t*----------------------*\n");
printf("\t\t\t************************\n");
}

